Merge pull request #4 from ParkerM2/feature/Add-discover-agent
Feature/add discover agent
